Repository: ednihs-yahska/Ed-Toolkit
Catalog: Ed-Toolkit/Localization/*.lproj/Localizable.strings
Languages: es, hi

# url_encoder_decoder.title
source: URL Encoder/Decoder
es: Codificador/Decodificador de URL
hi: URL एन्कोडर/डिकोडर

# url_encoder_decoder.input_label
source: Input:
es: Entrada:
hi: इनपुट:

# url_encoder_decoder.output_label
source: Output:
es: Salida:
hi: आउटपुट:

# url_encoder_decoder.mode_label
source: Mode
es: Modo
hi: मोड

# url_encoder_decoder.encode
source: Encode
es: Codificar
hi: एन्कोड

# url_encoder_decoder.decode
source: Decode
es: Decodificar
hi: डिकोड

# url_encoder_decoder.shortcuts_help
source: ⌘E/⌘D: Process text • ⌘M: Switch mode • ⌘R: Switch and process
es: ⌘E/⌘D: Procesar texto • ⌘M: Cambiar modo • ⌘R: Cambiar y procesar
hi: ⌘E/⌘D: टेक्स्ट प्रोसेस करें • ⌘M: मोड बदलें • ⌘R: मोड बदलें और प्रोसेस करें

# url_encoder_decoder.shortcuts_help_accessibility
source: Command E or Command D to process text, Command M to switch between encode and decode modes, Command R to switch mode and process immediately
es: Comando E o Comando D para procesar texto, Comando M para cambiar entre modos de codificación y decodificación, Comando R para cambiar modo y procesar inmediatamente
hi: टेक्स्ट प्रोसेस करने के लिए कमांड E या कमांड D, एन्कोड और डिकोड मोड के बीच बदलने के लिए कमांड M, मोड बदलने और तुरंत प्रोसेस करने के लिए कमांड R

# url_encoder_decoder.accessibility.title
source: URL Encoder and Decoder Tool
es: Herramienta de Codificador y Decodificador de URL
hi: URL एन्कोडर और डिकोडर टूल

# url_encoder_decoder.accessibility.shortcuts_help
source: Keyboard shortcuts help
es: Ayuda de atajos de teclado
hi: कीबोर्ड शॉर्टकट सहायता

# url_encoder_decoder.accessibility.mode_picker
source: Processing mode
es: Modo de procesamiento
hi: प्रसंस्करण मोड

# url_encoder_decoder.accessibility.input_label
source: Input text
es: Texto de entrada
hi: इनपुट टेक्स्ट

# url_encoder_decoder.accessibility.output_label
source: Output result
es: Resultado de salida
hi: आउटपुट परिणाम

# url_encoder_decoder.accessibility.main_view
source: URL Encoder Decoder
es: Codificador Decodificador de URL
hi: URL एन्कोडर डिकोडर

# url_encoder_decoder.accessibility.mode_hint
source: Choose whether to encode or decode the input text. Press Command M to toggle between modes.
es: Elija si codificar o decodificar el texto de entrada. Presione Comando M para alternar entre modos.
hi: इनपुट टेक्स्ट को एन्कोड या डिकोड करना है इसे चुनें। मोड के बीच टॉगल करने के लिए कमांड M दबाएं।

# url_encoder_decoder.accessibility.input_hint_encode
source: Enter the text you want to URL encode. Use Command+E to encode, Command+M to switch to decode mode, or Command+R to switch mode and process immediately.
es: Ingrese el texto que desea codificar en URL. Use Comando+E para codificar, Comando+M para cambiar al modo de decodificación, o Comando+R para cambiar modo y procesar inmediatamente.
hi: जो टेक्स्ट आप URL एन्कोड करना चाहते हैं उसे दर्ज करें। एन्कोड करने के लिए कमांड+E, डिकोड मोड पर स्विच करने के लिए कमांड+M, या मोड बदलने और तुरंत प्रोसेस करने के लिए कमांड+R का उपयोग करें।

# url_encoder_decoder.accessibility.input_hint_decode
source: Enter the URL encoded text you want to decode. Use Command+D to decode, Command+M to switch to encode mode, or Command+R to switch mode and process immediately.
es: Ingrese el texto codificado en URL que desea decodificar. Use Comando+D para decodificar, Comando+M para cambiar al modo de codificación, o Comando+R para cambiar modo y procesar inmediatamente.
hi: जो URL एन्कोडेड टेक्स्ट आप डिकोड करना चाहते हैं उसे दर्ज करें। डिकोड करने के लिए कमांड+D, एन्कोड मोड पर स्विच करने के लिए कमांड+M, या मोड बदलने और तुरंत प्रोसेस करने के लिए कमांड+R का उपयोग करें।

# url_encoder_decoder.accessibility.process_hint_encode
source: Converts the input text to URL encoded format. Use Tab to navigate to output field.
es: Convierte el texto de entrada al formato codificado de URL. Use Tab para navegar al campo de salida.
hi: इनपुट टेक्स्ट को URL एन्कोडेड फॉर्मेट में बदलता है। आउटपुट फील्ड पर नेविगेट करने के लिए Tab का उपयोग करें।

# url_encoder_decoder.accessibility.process_hint_decode
source: Converts the URL encoded input back to readable text. Use Tab to navigate to output field.
es: Convierte la entrada codificada de URL de vuelta a texto legible. Use Tab para navegar al campo de salida.
hi: URL एन्कोडेड इनपुट को वापस पढ़ने योग्य टेक्स्ट में बदलता है। आउटपुट फील्ड पर नेविगेट करने के लिए Tab का उपयोग करें।

# url_encoder_decoder.accessibility.output_hint
source: The processed output. This field is read-only and not editable.
es: La salida procesada. Este campo es de solo lectura y no se puede editar.
hi: प्रोसेस किया गया आउटपुट। यह फील्ड केवल पढ़ने योग्य है और संपादन योग्य नहीं है।

# url_encoder_decoder.accessibility.text_to_encode
source: Text to encode
es: Texto para codificar
hi: एन्कोड करने के लिए टेक्स्ट

# url_encoder_decoder.accessibility.text_to_decode
source: Text to decode
es: Texto para decodificar
hi: डिकोड करने के लिए टेक्स्ट

# url_encoder_decoder.accessibility.encoded_result
source: Encoded result
es: Resultado codificado
hi: एन्कोडेड परिणाम

# url_encoder_decoder.accessibility.decoded_result
source: Decoded result
es: Resultado decodificado
hi: डिकोडेड परिणाम

# url_encoder_decoder.accessibility.encode_button
source: Encode text
es: Codificar texto
hi: टेक्स्ट एन्कोड करें

# url_encoder_decoder.accessibility.decode_button
source: Decode text
es: Decodificar texto
hi: टेक्स्ट डिकोड करें

# url_encoder_decoder.accessibility.no_output
source: No output yet
es: Aún no hay salida
hi: अभी तक कोई आउटपुट नहीं

# url_encoder_decoder.status.switched_to_encode
source: Switched to encode mode
es: Cambiado al modo de codificación
hi: एन्कोड मोड पर स्विच किया गया

# url_encoder_decoder.status.switched_to_decode
source: Switched to decode mode
es: Cambiado al modo de decodificación
hi: डिकोड मोड पर स्विच किया गया

# url_encoder_decoder.status.encoded_success
source: Text encoded successfully, result has %d characters
es: Texto codificado exitosamente, el resultado tiene %d caracteres
hi: टेक्स्ट सफलतापूर्वक एन्कोड किया गया, परिणाम में %d अक्षर हैं

# url_encoder_decoder.status.decoded_success
source: Text decoded successfully, result has %d characters
es: Texto decodificado exitosamente, el resultado tiene %d caracteres
hi: टेक्स्ट सफलतापूर्वक डिकोड किया गया, परिणाम में %d अक्षर हैं

# url_encoder_decoder.status.encoding_failed
source: Encoding failed
es: Falló la codificación
hi: एन्कोडिंग विफल

# url_encoder_decoder.status.decoding_failed
source: Decoding failed - invalid input
es: Falló la decodificación - entrada inválida
hi: डिकोडिंग विफल - अमान्य इनपुट

# url_encoder_decoder.status.no_input
source: No input to process
es: No hay entrada para procesar
hi: प्रोसेस करने के लिए कोई इनपुट नहीं

# url_encoder_decoder.switch_mode
source: Switch Mode
es: Cambiar Modo
hi: मोड बदलें

# url_encoder_decoder.switch_and_process
source: Switch and Process
es: Cambiar y Procesar
hi: मोड बदलें और प्रोसेस करें

# url_encoder_decoder.action.show_shortcuts
source: Show keyboard shortcuts
es: Mostrar atajos de teclado
hi: कीबोर्ड शॉर्टकट दिखाएं

# url_encoder_decoder.action.repeat_shortcuts
source: Repeat shortcuts
es: Repetir atajos
hi: शॉर्टकट दोहराएं

# url_encoder_decoder.accessibility.help_info
source: Help information
es: Información de ayuda
hi: सहायता जानकारी

# url_encoder_decoder.accessibility.shortcuts_available
source: Available keyboard shortcuts: Command E to encode text, Command D to decode text, Command M to switch between encode and decode modes, Command R to switch mode and process text immediately
es: Atajos de teclado disponibles: Comando E para codificar texto, Comando D para decodificar texto, Comando M para cambiar entre modos de codificación y decodificación, Comando R para cambiar modo y procesar texto inmediatamente
hi: उपलब्ध कीबोर्ड शॉर्टकट: टेक्स्ट एन्कोड करने के लिए कमांड E, टेक्स्ट डिकोड करने के लिए कमांड D, एन्कोड और डिकोड मोड के बीच स्विच करने के लिए कमांड M, मोड बदलने और तुरंत टेक्स्ट प्रोसेस करने के लिए कमांड R

# diff_matcher.title
source: Diff Matcher
es: Comparador de Diferencias
hi: डिफ मैचर

# diff_matcher.subtitle
source: Compare two texts and see the differences
es: Compara dos textos y ve las diferencias
hi: दो टेक्स्ट की तुलना करें और अंतर देखें

# diff_matcher.original_text
source: Original Text
es: Texto Original
hi: मूल टेक्स्ट

# diff_matcher.modified_text
source: Modified Text
es: Texto Modificado
hi: संशोधित टेक्स्ट

# diff_matcher.compare
source: Compare
es: Comparar
hi: तुलना करें

# diff_matcher.back_to_input
source: Back to Input
es: Volver a Entrada
hi: इनपुट पर वापस

# diff_matcher.additions
source: additions
es: adiciones
hi: जोड़े गए

# diff_matcher.deletions
source: deletions
es: eliminaciones
hi: हटाए गए

# diff_matcher.additions_count
source: %d additions
es: %d adiciones
hi: %d जोड़े गए

# diff_matcher.deletions_count
source: %d deletions
es: %d eliminaciones
hi: %d हटाए गए

# diff_matcher.diff_summary
source: Found %d additions and %d deletions
es: Se encontraron %d adiciones y %d eliminaciones
hi: %d जोड़े गए और %d हटाए गए मिले

# diff_matcher.accessibility.title
source: Text Difference Comparison Tool
es: Herramienta de Comparación de Diferencias de Texto
hi: टेक्स्ट अंतर तुलना टूल

# diff_matcher.accessibility.subtitle
source: Compare two texts and see the differences
es: Compara dos textos y ve las diferencias
hi: दो टेक्स्ट की तुलना करें और अंतर देखें

# diff_matcher.accessibility.original_text_editor
source: Original text input area
es: Área de entrada de texto original
hi: मूल टेक्स्ट इनपुट क्षेत्र

# diff_matcher.accessibility.modified_text_editor
source: Modified text input area
es: Área de entrada de texto modificado
hi: संशोधित टेक्स्ट इनपुट क्षेत्र

# diff_matcher.accessibility.compare_button
source: Compare texts
es: Comparar textos
hi: टेक्स्ट की तुलना करें

# diff_matcher.accessibility.back_button
source: Back to input view
es: Volver a vista de entrada
hi: इनपुट व्यू पर वापस

# diff_matcher.accessibility.results_view
source: Comparison results
es: Resultados de comparación
hi: तुलना परिणाम

# diff_matcher.accessibility.diff_line
source: Difference line
es: Línea de diferencia
hi: अंतर लाइन

# diff_matcher.accessibility.main_view
source: Diff Matcher
es: Comparador de Diferencias
hi: डिफ मैचर

# diff_matcher.accessibility.original_text_hint
source: Enter the original text that you want to compare. This will be shown as the baseline for comparison.
es: Ingrese el texto original que desea comparar. Este se mostrará como la línea base para la comparación.
hi: मूल टेक्स्ट दर्ज करें जिसकी आप तुलना करना चाहते हैं। यह तुलना के लिए आधार रेखा के रूप में दिखाया जाएगा।

# diff_matcher.accessibility.modified_text_hint
source: Enter the modified text that you want to compare against the original. Changes will be highlighted in the results.
es: Ingrese el texto modificado que desea comparar contra el original. Los cambios se resaltarán en los resultados.
hi: संशोधित टेक्स्ट दर्ज करें जिसकी आप मूल के साथ तुलना करना चाहते हैं। परिवर्तन परिणामों में हाइलाइट किए जाएंगे।

# diff_matcher.accessibility.compare_hint
source: Process both texts and show the differences. Additions will be shown in green, deletions in red.
es: Procesa ambos textos y muestra las diferencias. Las adiciones se mostrarán en verde, las eliminaciones en rojo.
hi: दोनों टेक्स्ट को प्रोसेस करें और अंतर दिखाएं। जोड़े गए हरे रंग में, हटाए गए लाल रंग में दिखाए जाएंगे।

# diff_matcher.accessibility.back_hint
source: Return to the input view to modify the texts for comparison.
es: Regresar a la vista de entrada para modificar los textos para comparación.
hi: तुलना के लिए टेक्स्ट को संशोधित करने के लिए इनपुट व्यू पर वापस जाएं।

# diff_matcher.accessibility.results_hint
source: Shows line-by-line comparison with additions in green and deletions in red.
es: Muestra comparación línea por línea con adiciones en verde y eliminaciones en rojo.
hi: हरे रंग में जोड़े गए और लाल रंग में हटाए गए के साथ लाइन-बाय-लाइन तुलना दिखाता है।

# diff_matcher.accessibility.no_changes
source: No differences found between the texts
es: No se encontraron diferencias entre los textos
hi: टेक्स्ट के बीच कोई अंतर नहीं मिला

# diff_matcher.accessibility.changes_found
source: Differences found and highlighted
es: Diferencias encontradas y resaltadas
hi: अंतर मिले और हाइलाइट किए गए

# diff_matcher.accessibility.empty_input
source: Please enter text in both fields to compare
es: Por favor ingrese texto en ambos campos para comparar
hi: कृपया तुलना करने के लिए दोनों फील्ड में टेक्स्ट दर्ज करें

# diff_matcher.accessibility.returned_to_input
source: Returned to input view
es: Regresado a la vista de entrada
hi: इनपुट व्यू पर वापस आ गए

# diff_matcher.accessibility.all_text_cleared
source: All text cleared
es: Todo el texto eliminado
hi: सभी टेक्स्ट साफ कर दिया गया

# diff_matcher.accessibility.texts_swapped
source: Text areas swapped
es: Áreas de texto intercambiadas
hi: टेक्स्ट क्षेत्र अदला-बदली की गई

# diff_matcher.accessibility.keyboard_shortcuts
source: ⌘R: Compare texts • ⌘B: Back to input • ⌘K: Clear all • ⌘S: Swap texts • ⌘⌥→/←: Navigate between text areas
es: ⌘R: Comparar textos • ⌘B: Volver a entrada • ⌘K: Limpiar todo • ⌘S: Intercambiar textos • ⌘⌥→/←: Navegar entre áreas de texto
hi: ⌘R: टेक्स्ट तुलना करें • ⌘B: इनपुट पर वापस • ⌘K: सभी साफ करें • ⌘S: टेक्स्ट अदला-बदली करें • ⌘⌥→/←: टेक्स्ट क्षेत्रों के बीच नेविगेट करें

# json_formatter.title
source: JSON Formatter
es: Formateador JSON
hi: JSON फॉर्मेटर

# json_formatter.subtitle
source: Parse and visualize JSON structure
es: Analizar y visualizar estructura JSON
hi: JSON संरचना का विश्लेषण और दृश्यीकरण करें • ⌘⌥C: फॉर्मेटेड JSON कॉपी करें

# json_formatter.input_label
source: Input JSON
es: JSON de Entrada
hi: JSON इनपुट

# json_formatter.structure_label
source: JSON Structure
es: Estructura JSON
hi: JSON संरचना

# json_formatter.placeholder_text
source: Paste JSON to see structure
es: Pegar JSON para ver estructura
hi: संरचना देखने के लिए JSON पेस्ट करें

# json_formatter.invalid_input
source: Invalid input
es: Entrada inválida
hi: अमान्य इनपुट

# json_formatter.invalid_json_prefix
source: Invalid JSON:
es: JSON inválido:
hi: अमान्य JSON:

# json_formatter.object_type
source: Object
es: Objeto
hi: ऑब्जेक्ट

# json_formatter.array_type
source: Array
hi: ऐरे

# json_formatter.string_type
source: String
es: Cadena
hi: स्ट्रिंग

# json_formatter.number_type
source: Number
es: Número
hi: संख्या

# json_formatter.boolean_type
source: Boolean
es: Booleano
hi: बूलियन

# json_formatter.null_type
source: Null
es: Nulo
hi: नल

# json_formatter.expand
source: Expand
es: Expandir
hi: विस्तृत करें

# json_formatter.collapse
source: Collapse
es: Contraer
hi: संक्षिप्त करें

# json_formatter.expand_all
source: Expand All
es: Expandir Todo
hi: सभी विस्तृत करें

# json_formatter.collapse_all
source: Collapse All
es: Contraer Todo
hi: सभी संक्षिप्त करें

# json_formatter.clear
source: Clear
es: Limpiar
hi: साफ़ करें

# json_formatter.format
source: Format
es: Formatear
hi: फॉर्मेट करें

# json_formatter.object_count
source: Object with %d properties
es: Objeto con %d propiedades
hi: %d गुणों वाला ऑब्जेक्ट

# json_formatter.array_count
source: Array with %d items
es: Array con %d elementos
hi: %d आइटमों वाला ऐरे

# json_formatter.node_with_key
source: %@ key containing %@
es: Clave %@ conteniendo %@
hi: कुंजी %@ जिसमें %@ है

# json_formatter.node_without_key
source: Root %@
es: %@ raíz
hi: रूट %@

# json_formatter.accessibility.title
source: JSON Parser and Formatter Tool
es: Herramienta de Analizador y Formateador JSON
hi: JSON पार्सर और फॉर्मेटर टूल

# json_formatter.accessibility.subtitle
source: Parse and visualize JSON structure
es: Analizar y visualizar estructura JSON
hi: JSON संरचना का विश्लेषण और दृश्यीकरण करें

# json_formatter.accessibility.input_editor
source: JSON input text area
es: Área de texto de entrada JSON
hi: JSON इनपुट टेक्स्ट क्षेत्र

# json_formatter.accessibility.structure_view
source: JSON structure tree view
es: Vista de árbol de estructura JSON
hi: JSON संरचना ट्री व्यू

# json_formatter.accessibility.error_view
source: JSON parsing error message
es: Mensaje de error de análisis JSON
hi: JSON पार्सिंग त्रुटि संदेश

# json_formatter.accessibility.placeholder_view
source: Empty state placeholder
es: Marcador de posición de estado vacío
hi: खाली स्थिति प्लेसहोल्डर

# json_formatter.accessibility.main_view
source: JSON Formatter
es: Formateador JSON
hi: JSON फॉर्मेटर

# json_formatter.accessibility.expand_button
source: Expand node
es: Expandir nodo
hi: नोड विस्तृत करें

# json_formatter.accessibility.collapse_button
source: Collapse node
es: Contraer nodo
hi: नोड संक्षिप्त करें

# json_formatter.accessibility.json_node
source: JSON node
es: Nodo JSON
hi: JSON नोड

# json_formatter.accessibility.object_node
source: JSON object
es: Objeto JSON
hi: JSON ऑब्जेक्ट

# json_formatter.accessibility.array_node
source: JSON array
es: Array JSON
hi: JSON ऐरे

# json_formatter.accessibility.value_node
source: JSON value
es: Valor JSON
hi: JSON वैल्यू

# json_formatter.accessibility.input_hint
source: Enter or paste JSON text to parse and visualize its structure. Real-time parsing will show results immediately.
es: Ingrese o pegue texto JSON para analizar y visualizar su estructura. El análisis en tiempo real mostrará resultados inmediatamente.
hi: JSON टेक्स्ट दर्ज करें या पेस्ट करें ताकि इसकी संरचना का विश्लेषण और दृश्यीकरण हो सके। रियल-टाइम पार्सिंग तुरंत परिणाम दिखाएगी।

# json_formatter.accessibility.structure_hint
source: Navigate through the JSON structure. Objects and arrays can be expanded or collapsed.
es: Navegue a través de la estructura JSON. Los objetos y arrays se pueden expandir o contraer.
hi: JSON संरचना में नेविगेट करें। ऑब्जेक्ट्स और ऐरे को विस्तृत या संक्षिप्त किया जा सकता है।

# json_formatter.accessibility.node_hint
source: Click or press Space to expand or collapse this node.
es: Haga clic o presione Espacio para expandir o contraer este nodo.
hi: इस नोड को विस्तृत या संक्षिप्त करने के लिए क्लिक करें या स्पेस दबाएं।

# json_formatter.accessibility.expand_hint
source: Expand to show child elements.
es: Expandir para mostrar elementos hijos.
hi: चाइल्ड एलिमेंट्स दिखाने के लिए विस्तृत करें।

# json_formatter.accessibility.collapse_hint
source: Collapse to hide child elements.
es: Contraer para ocultar elementos hijos.
hi: चाइल्ड एलिमेंट्स छुपाने के लिए संक्षिप्त करें।

# json_formatter.accessibility.json_parsed
source: JSON parsed successfully
es: JSON analizado exitosamente
hi: JSON सफलतापूर्वक पार्स किया गया

# json_formatter.accessibility.parse_error
source: JSON parsing failed
es: Falló el análisis JSON
hi: JSON पार्सिंग असफल

# json_formatter.accessibility.empty_input
source: No JSON input provided
es: No se proporcionó entrada JSON
hi: कोई JSON इनपुट प्रदान नहीं किया गया

# json_formatter.accessibility.keyboard_shortcuts
source: ⌘K: Clear input • ⌘F: Format JSON • Space: Expand/collapse node
es: ⌘K: Limpiar entrada • ⌘F: Formatear JSON • Espacio: Expandir/contraer nodo
hi: ⌘K: इनपुट साफ करें • ⌘F: JSON फॉर्मेट करें • ⌘⌥C: JSON कॉपी करें • स्पेस: नोड विस्तृत/संक्षिप्त करें
